import os

BOT_TOKEN = os.environ.get("BOT_TOKEN", "8948238511:AAEYX3CjbejSdRThCUSJci6gL4jxjp_9xeA")
CHAT_ID = os.environ.get("CHAT_ID", "955359991")

KUFAR_API_URL = "https://api.kufar.by/search-api/v2/search/rendered-paginated"
KUFAR_PARAMS = {
    "rgn": "7",
    "prc": "r:0,0",
    "size": "50",
    "lang": "ru",
    "sort": "lst.d",
}

SEEN_FILE = "seen_ids.json"

BLACKLIST = [
    "кот", "кошк", "котён", "котик", "кошеч",
    "собак", "щенок", "щенк", "пёс", "песик", "пёсик",
    "хомяк", "хомяч", "попугай", "попуг",
    "кролик", "крольч", "черепах", "рыбк", "аквариум",
    "животн", "питомец", "питомц",
    "корм для", "лоток", "наполнител", "клетк",
    "птиц", "птич", "канарейк", "голуб",
    "морск свинк", "крыс", "шиншилл", "хорёк", "хорек",
    "ветеринар", "стерилиз", "кастрир", "прививк",
    "приют", "передержк", "в добрые руки",
]
